[
    {
        "name": "response_to_human",
        "description": "\nresponse_to_human: Useful for: Generating responses to user queries or statements. This tool is used to provide answers, explanations, or engage in conversation with the user.\n    Examples of use:\n        \"What is the capital of France?\" → \"The capital of France is Paris.\"\n        \"Tell me a joke.\" → \"Why did the scarecrow win an award? Because he was outstanding in his field!\"\n        \"How are you?\" → \"I'm doing well, thank you! How can I assist you today?\"\n"
    },
    {
        "name": "calculator",
        "description": "\ncalculator: Useful for: Solving mathematical expressions and answering math-related questions.\n    Examples of use:\n        \"What is 2 + 2?\" → 2 + 2\n        \"Find the result of (8 * 32) ^ 27\" → (8 * 32) ** 27\n        \"Solve 4 - (2 * (7 + 6))\" → 4 - (2 * (7 + 6))\n"
    },
    {
        "name": "programmer",
        "description": "\nprogrammer: Useful for: Generating a new tool when the user requests functionality that is not currently available. This tool sends a prompt to a programmer LLM to create the required function.\n    Examples of use:\n        \"I need a tool to convert text to Morse code.\" → The Programmer tool will be used to generate a text-to-Morse converter.\n        \"Can you create a function that summarizes text?\" → The Programmer tool will generate a text summarization tool.\n"
    },
    {
        "name": "teacher",
        "description": "\nteacher: Useful for: Remembering relevant information that may be useful in the future and adapting behavior based on user requests. This tool stores details shared by the user, such as preferences, facts, or requested changes in interaction style, so that it can be retrieved when needed.\n    Examples of use:\n        \"Remember that I prefer short answers.\" → The Teacher tool will store this preference and generate concise responses in the future.\n        \"Call me Alex from now on.\" → The Teacher tool will remember to address the user as Alex.\n        \"I like detailed explanations for technical topics.\" → The Teacher tool will ensure future technical responses are in-depth.\n"
    }
    ]